### Note
* Instructions have been included for each segment. You do not have to follow them exactly, but they are included to help you think through the steps.

In [1]:
# Dependencies and Setup
import pandas as pd

# File to Load (Remember to Change These)
file_to_load = "Resources/purchase_data.csv"

# Read Purchasing File and store into Pandas data frame
purchase_data = pd.read_csv(file_to_load)
purchase_data

,Purchase ID,SN,Age,Gender,Item ID,Item Name,Price
0,0,Lisim78,20,Male,108,"Extraction, Quickblade Of Trembling Hands",3.53
1,1,Lisovynya38,40,Male,143,Frenzied Scimitar,1.56
2,2,Ithergue48,24,Male,92,Final Critic,4.88
3,3,Chamassasya86,24,Male,100,Blindscythe,3.27
4,4,Iskosia90,23,Male,131,Fury,1.44
...,...,...,...,...,...,...,...
775,775,Aethedru70,21,Female,60,Wolf,3.54
776,776,Iral74,21,Male,164,Exiled Doomblade,1.63
777,777,Yathecal72,20,Male,67,"Celeste, Incarnation of the Corrupted",3.46
778,778,Sisur91,7,Male,92,Final Critic,4.19
779,779,Ennrian78,24,Male,50,Dawn,4.60

In [2]:
# Finding number of unique players
player_count = len(purchase_data["SN"].unique())
player_count

576

* Display the total number of players

In [3]:
# Displaying total number of players in a data frame
total_player_df = pd.DataFrame({"Total Players":[player_count]})
total_player_df

   Total Players
0            576

## Purchasing Analysis (Total)

* Run basic calculations to obtain number of unique items, average price, etc.


* Create a summary data frame to hold the results


* Optional: give the displayed data cleaner formatting


* Display the summary data frame

In [4]:
# Calculating number of unique items
unique_item_count = len(purchase_data["Item ID"].unique())
unique_item_count

179

In [5]:
# Calculating average price
avg_price = round(purchase_data["Price"].mean(),2)
avg_price

3.05

In [6]:
total_revenue = purchase_data["Price"].sum()
total_revenue

2379.77

In [7]:
number_of_purchases = len(purchase_data["Price"])
number_of_purchases

780

In [8]:
purchase_analysis_df = pd.DataFrame({"Number of Unique Items": [unique_item_count],
                                     "Average Price of Items": [avg_price],
                                     "Number of Purchases":[number_of_purchases],
                                     "Total Revenue":[total_revenue]})
purchase_analysis_df

,Number of Unique Items,Average Price of Items,Number of Purchases,Total Revenue
0,179,3.05,780,2379.77

## Gender Demographics

* Percentage and Count of Male Players


* Percentage and Count of Female Players


* Percentage and Count of Other / Non-Disclosed

In [9]:
# Calculating number of male players
male_players_df = purchase_data.loc[purchase_data["Gender"] == "Male",:]
male_count = len(male_players_df["SN"].unique())
male_count

484

In [10]:
# Calculating number of female players
female_players_df = purchase_data.loc[purchase_data["Gender"] == "Female",:]
female_count = len(female_players_df["SN"].unique())
female_count

81

In [11]:
# Calculating number of other/non-disclosed players
other_count = player_count - (male_count + female_count)
other_count

11

In [12]:
# Calculating percentages
percent_male = round((male_count/player_count) * 100,2)
percent_female = round((female_count/player_count) * 100,)
percent_other = round((other_count/player_count) * 100,2)

In [13]:
# Creating gender demographics data frame
gender_demo = pd.DataFrame({
    "Gender":["Male","Female","Other/Non-Disclosed"],
    "Player Count":[male_count,female_count,other_count],
    "Percentage of Players":[percent_male,percent_female,percent_other]
})
gender_demo

                Gender  Player Count  Percentage of Players
0                 Male           484                  84.03
1               Female            81                  14.00
2  Other/Non-Disclosed            11                   1.91


## Purchasing Analysis (Gender)

* Run basic calculations to obtain purchase count, avg. purchase price, avg. purchase total per person etc. by gender




* Create a summary data frame to hold the results


* Optional: give the displayed data cleaner formatting


* Display the summary data frame

In [14]:
male_players_df

,Purchase ID,SN,Age,Gender,Item ID,Item Name,Price
0,0,Lisim78,20,Male,108,"Extraction, Quickblade Of Trembling Hands",3.53
1,1,Lisovynya38,40,Male,143,Frenzied Scimitar,1.56
2,2,Ithergue48,24,Male,92,Final Critic,4.88
3,3,Chamassasya86,24,Male,100,Blindscythe,3.27
4,4,Iskosia90,23,Male,131,Fury,1.44
...,...,...,...,...,...,...,...
774,774,Jiskjask80,11,Male,92,Final Critic,4.19
776,776,Iral74,21,Male,164,Exiled Doomblade,1.63
777,777,Yathecal72,20,Male,67,"Celeste, Incarnation of the Corrupted",3.46
778,778,Sisur91,7,Male,92,Final Critic,4.19
779,779,Ennrian78,24,Male,50,Dawn,4.60

In [15]:
# Finding number of item purchases by males
male_purchases = len(male_players_df["Item Name"])
male_purchases

652

In [16]:
# Finding number of item purchases by females
female_purchases = len(female_players_df["Item Name"])
female_purchases

113

In [17]:
# Finding number of average purchase total per person by males
avg_purchases_male = round(male_players_df["Price"].mean(),2)
avg_purchases_male

3.02

In [18]:
# Finding number of average purchase total per person by females
avg_purchases_female = round(female_players_df["Price"].mean(),2)
avg_purchases_female

3.2

In [19]:
# Calculations for other/non-disclosed players
other_players_df = purchase_data.loc[purchase_data["Gender"] == "Other / Non-Disclosed",:]
other_purchases = len(other_players_df["Item Name"])
avg_purchases_other = round(other_players_df["Price"].mean(),2)

In [20]:
# Calculating total purchases for male, female and other
total_purchase_male = male_players_df["Price"].sum()
total_purchase_female = female_players_df["Price"].sum()
total_purchase_other = other_players_df["Price"].sum()

In [21]:
# Creating purchase analysis data frame
purchase_analysis_df = pd.DataFrame({
    "Gender":["Male","Female","Other/Non-Disclosed"],
    "Number of Purchases":[male_purchases,female_purchases,other_purchases],
    "Average Purchase Price":[avg_purchases_male,avg_purchases_female,avg_purchases_other],
    "Total Purchase Value":[total_purchase_male,total_purchase_female,total_purchase_other]
})
purchase_analysis_df

,Gender,Number of Purchases,Average Purchase Price,Total Purchase Value
0,Male,652,3.02,1967.64
1,Female,113,3.20,361.94
2,Other/Non-Disclosed,15,3.35,50.19

## Age Demographics

* Establish bins for ages


* Categorize the existing players using the age bins. Hint: use pd.cut()


* Calculate the numbers and percentages by age group


* Create a summary data frame to hold the results


* Optional: round the percentage column to two decimal points


* Display Age Demographics Table

In [22]:
# Showing all ages of male players
purchase_data["Age"].unique()

array([20, 40, 24, 23, 22, 36, 35, 21, 30, 38, 29, 11,  7, 19, 37, 10,  8,
       18, 27, 33, 32, 25, 12, 34, 17, 15, 13, 26, 16, 28, 31, 39, 44, 41,
        9, 14, 42, 43, 45], dtype=int64)

In [23]:
# Creating a bin of ages of all players
age_bins = [0,9,14,19,24,29,34,39,45]
# Creating labels for bins
age_labels = ["<10","10-14","15-19","20-24","25-29","30-34","35-39","40+"]

In [24]:
# Slicing data and placing data series into a new column
pd.cut(purchase_data["Age"],age_bins,labels=age_labels).head()

0    20-24
1      40+
2    20-24
3    20-24
4    20-24
Name: Age, dtype: category
Categories (8, object): [<10 < 10-14 < 15-19 < 20-24 < 25-29 < 30-34 < 35-39 < 40+]

In [25]:
purchase_data["Age Group"] = pd.cut(purchase_data["Age"],age_bins,labels=age_labels,include_lowest=True)
purchase_data

,Purchase ID,SN,Age,Gender,Item ID,Item Name,Price,Age Group
0,0,Lisim78,20,Male,108,"Extraction, Quickblade Of Trembling Hands",3.53,20-24
1,1,Lisovynya38,40,Male,143,Frenzied Scimitar,1.56,40+
2,2,Ithergue48,24,Male,92,Final Critic,4.88,20-24
3,3,Chamassasya86,24,Male,100,Blindscythe,3.27,20-24
4,4,Iskosia90,23,Male,131,Fury,1.44,20-24
...,...,...,...,...,...,...,...,...
775,775,Aethedru70,21,Female,60,Wolf,3.54,20-24
776,776,Iral74,21,Male,164,Exiled Doomblade,1.63,20-24
777,777,Yathecal72,20,Male,67,"Celeste, Incarnation of the Corrupted",3.46,20-24
778,778,Sisur91,7,Male,92,Final Critic,4.19,<10
779,779,Ennrian78,24,Male,50,Dawn,4.60,20-24

In [26]:
# Checking number of players within age groups
age_group = purchase_data.groupby(["Age Group"])
view_age_group = age_group[["Age Group"]].count()
view_age_group = view_age_group.rename(columns={"Age Group":"Age Group Count"})

In [27]:
age_group_percentage = round((age_group[["Age Group"]].count()/player_count) * 100,2)
age_group_percentage = age_group_percentage.rename(columns={"Age Group":"Percentage of Players"})
age_group_percentage.head()

           Percentage of Players
Age Group
<10                         3.99
10-14                       4.86
15-19                      23.61
20-24                      63.37
25-29                      17.53

In [28]:
age_demo = pd.merge(view_age_group,age_group_percentage,on="Age Group")
age_demo

           Age Group Count  Percentage of Players
Age Group
<10                     23                   3.99
10-14                   28                   4.86
15-19                  136                  23.61
20-24                  365                  63.37
25-29                  101                  17.53
30-34                   73                  12.67
35-39                   41                   7.12
40+                     13                   2.26

## Purchasing Analysis (Age)

* Bin the purchase_data data frame by age


* Run basic calculations to obtain purchase count, avg. purchase price, avg. purchase total per person etc. in the table below


* Create a summary data frame to hold the results


* Optional: give the displayed data cleaner formatting


* Display the summary data frame

In [29]:
# Creating a bin of ages of all players
age_bins = [0,9,14,19,24,29,34,39,50]
# Creating labels for bins by age
age_labels = ["<10","10-14","15-19","20-24","25-29","30-34","35-39","40+"]
pd.cut(purchase_data["Age"],age_bins,labels=age_labels).head()
purchase_data.head()

,Purchase ID,SN,Age,Gender,Item ID,Item Name,Price,Age Group
0,0,Lisim78,20,Male,108,"Extraction, Quickblade Of Trembling Hands",3.53,20-24
1,1,Lisovynya38,40,Male,143,Frenzied Scimitar,1.56,40+
2,2,Ithergue48,24,Male,92,Final Critic,4.88,20-24
3,3,Chamassasya86,24,Male,100,Blindscythe,3.27,20-24
4,4,Iskosia90,23,Male,131,Fury,1.44,20-24

In [30]:
# Purchase count
view_age_group

           Age Group Count
Age Group
<10                     23
10-14                   28
15-19                  136
20-24                  365
25-29                  101
30-34                   73
35-39                   41
40+                     13

In [31]:
# Total purchase value
total_purchase_value = round(age_group[["Price"]].sum(),2)
total_purchase_value.rename(columns={"Price":"Total Purchase Value"})

           Total Purchase Value
Age Group
<10                       77.13
10-14                     82.78
15-19                    412.89
20-24                   1114.06
25-29                    293.00
30-34                    214.00
35-39                    147.67
40+                       38.24

In [32]:
# Average purchase price
avg_purchase_price = round(age_group[["Price"]].mean(),2)
avg_purchase_price.rename(columns={"Price":"Average Purchase Price"})

           Average Purchase Price
Age Group
<10                          3.35
10-14                        2.96
15-19                        3.04
20-24                        3.05
25-29                        2.90
30-34                        2.93
35-39                        3.60
40+                          2.94

In [33]:
# Average total purchase per person
avg_total_per_purchase = age_group[["SN","Price"]].mean()
avg_total_per_purchase

              Price
Age Group
<10        3.353478
10-14      2.956429
15-19      3.035956
20-24      3.052219
25-29      2.900990
30-34      2.931507
35-39      3.601707
40+        2.941538

## Top Spenders

* Run basic calculations to obtain the results in the table below


* Create a summary data frame to hold the results


* Sort the total purchase value column in descending order


* Optional: give the displayed data cleaner formatting


* Display a preview of the summary data frame

In [34]:
# Grouping by players of the purchase_data 
group_names = purchase_data.groupby(['SN'])
group_names.head()

,Purchase ID,SN,Age,Gender,Item ID,Item Name,Price,Age Group
0,0,Lisim78,20,Male,108,"Extraction, Quickblade Of Trembling Hands",3.53,20-24
1,1,Lisovynya38,40,Male,143,Frenzied Scimitar,1.56,40+
2,2,Ithergue48,24,Male,92,Final Critic,4.88,20-24
3,3,Chamassasya86,24,Male,100,Blindscythe,3.27,20-24
4,4,Iskosia90,23,Male,131,Fury,1.44,20-24
...,...,...,...,...,...,...,...,...
775,775,Aethedru70,21,Female,60,Wolf,3.54,20-24
776,776,Iral74,21,Male,164,Exiled Doomblade,1.63,20-24
777,777,Yathecal72,20,Male,67,"Celeste, Incarnation of the Corrupted",3.46,20-24
778,778,Sisur91,7,Male,92,Final Critic,4.19,<10
779,779,Ennrian78,24,Male,50,Dawn,4.60,20-24

In [35]:
# Sorting by highest to lowest total purchase value
top_spenders = group_names[["Price"]].sum()
top_spenders
top_spenders_sorted = top_spenders.sort_values(["Price"],ascending=False)
top_spenders_sorted.rename(columns={"Price":"Total Purchase Value"})

             Total Purchase Value
SN
Lisosia93                   18.96
Idastidru52                 15.45
Chamjask73                  13.83
Iral74                      13.62
Iskadarya95                 13.10
...                           ...
Ililsasya43                  1.02
Irilis75                     1.02
Aidai61                      1.01
Chanirra79                   1.01
Alo38                        1.00

[576 rows x 1 columns]

In [36]:
# Sorting highest number of purchases
top_spenders_purchase_count = group_names[["SN"]].count()
top_spenders_purchase_count = top_spenders_purchase_count.rename(columns={"SN":"Purchase Count"})
top_spenders_purchase_count_sorted = top_spenders_purchase_count.sort_values(["Purchase Count"],ascending=False)
top_spenders_purchase_count_sorted

              Purchase Count
SN
Lisosia93                  5
Iral74                     4
Idastidru52                4
Asur53                     3
Inguron55                  3
...                      ...
Hala31                     1
Haisurra41                 1
Hailaphos89                1
Haestyphos66               1
Iskosian40                 1

[576 rows x 1 columns]

In [37]:
# Combining both data frames
top_spenders_df = pd.merge(top_spenders_sorted,top_spenders_purchase_count_sorted,on="SN")
top_spenders_df.head(5)

             Price  Purchase Count
SN
Lisosia93    18.96               5
Idastidru52  15.45               4
Chamjask73   13.83               3
Iral74       13.62               4
Iskadarya95  13.10               3

In [43]:
# Final data frame
top_spenders_df["Average Purchase Values"] = round(top_spenders_df["Price"]/top_spenders_df["Purchase Count"],2)
top_spenders_df.head(5)

             Price  Purchase Count  Average Purchase Values
SN
Lisosia93    18.96               5                     3.79
Idastidru52  15.45               4                     3.86
Chamjask73   13.83               3                     4.61
Iral74       13.62               4                     3.40
Iskadarya95  13.10               3                     4.37

## Most Popular Items

* Retrieve the Item ID, Item Name, and Item Price columns


* Group by Item ID and Item Name. Perform calculations to obtain purchase count, item price, and total purchase value


* Create a summary data frame to hold the results


* Sort the purchase count column in descending order


* Optional: give the displayed data cleaner formatting


* Display a preview of the summary data frame

In [82]:
# Grouping items
group_items = purchase_data.groupby(['Item Name'])
group_items.head()

,Purchase ID,SN,Age,Gender,Item ID,Item Name,Price,Age Group
0,0,Lisim78,20,Male,108,"Extraction, Quickblade Of Trembling Hands",3.53,20-24
1,1,Lisovynya38,40,Male,143,Frenzied Scimitar,1.56,40+
2,2,Ithergue48,24,Male,92,Final Critic,4.88,20-24
3,3,Chamassasya86,24,Male,100,Blindscythe,3.27,20-24
4,4,Iskosia90,23,Male,131,Fury,1.44,20-24
...,...,...,...,...,...,...,...,...
764,764,Saedaiphos46,18,Male,113,Solitude's Reaver,4.07,15-19
765,765,Irith83,18,Male,130,Alpha,2.07,15-19
766,766,Aelastirin39,23,Male,58,"Freak's Bite, Favor of Holy Might",4.14,20-24
777,777,Yathecal72,20,Male,67,"Celeste, Incarnation of the Corrupted",3.46,20-24
779,779,Ennrian78,24,Male,50,Dawn,4.60,20-24

In [107]:
# Obtaining total price of items
item_prices = group_items[["Item Name","Price"]]
item_prices.head()

                                     Item Name  Price
0    Extraction, Quickblade Of Trembling Hands   3.53
1                            Frenzied Scimitar   1.56
2                                 Final Critic   4.88
3                                  Blindscythe   3.27
4                                         Fury   1.44
..                                         ...    ...
764                          Solitude's Reaver   4.07
765                                      Alpha   2.07
766          Freak's Bite, Favor of Holy Might   4.14
777      Celeste, Incarnation of the Corrupted   3.46
779                                       Dawn   4.60

[690 rows x 2 columns]

In [104]:
# Obtaining top items purchased and their purchase count
top_item_count = group_items[["Item Name"]].count()
top_item_count = top_item_count.rename(columns={"Item Name":"Purchase Count"})
top_item_count = top_item_count.sort_values(["Purchase Count"],ascending=False)
top_item_count

                                              Purchase Count
Item Name
Final Critic                                              13
Oathbreaker, Last Hope of the Breaking Storm              12
Persuasion                                                 9
Nirvana                                                    9
Extraction, Quickblade Of Trembling Hands                  9
...                                                      ...
Riddle, Tribute of Ended Dreams                            1
Betrayer                                                   1
The Decapitator                                            1
Gladiator's Glaive                                         1
Ghost Reaver, Longsword of Magic                           1

[179 rows x 1 columns]

In [ ]:
popular_items = pd.merge(top_item_count,item_prices,on="Item Name")

## Most Profitable Items

* Sort the above table by total purchase value in descending order


* Optional: give the displayed data cleaner formatting


* Display a preview of the data frame